; ModuleID = 'example.cgu-0.rs'
source_filename = "example.cgu-0.rs"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-darwin"

%str_slice = type { i8*, i64 }
%"core::fmt::ArgumentV1" = type { %"core::fmt::Void"*, i8 (%"core::fmt::Void"*, %"core::fmt::Formatter"*)* }
%"core::fmt::Void" = type { {} }
%"core::fmt::Formatter" = type { i32, i32, i8, %"core::option::Option<usize>", %"core::option::Option<usize>", { i8*, void (i8*)** }, %"core::slice::Iter<core::fmt::ArgumentV1>", { %"core::fmt::ArgumentV1"*, i64 } }
%"core::option::Option<usize>" = type { i64, [0 x i64], [1 x i64] }
%"core::slice::Iter<core::fmt::ArgumentV1>" = type { %"core::fmt::ArgumentV1"*, %"core::fmt::ArgumentV1"*, %"core::marker::PhantomData<&core::fmt::ArgumentV1>" }
%"core::marker::PhantomData<&core::fmt::ArgumentV1>" = type {}
%"core::any::TypeId" = type { i64 }
%"core::fmt::Arguments" = type { { %str_slice*, i64 }, %"core::option::Option<&[core::fmt::rt::v1::Argument]>", { %"core::fmt::ArgumentV1"*, i64 } }
%"core::option::Option<&[core::fmt::rt::v1::Argument]>" = type { { %"core::fmt::rt::v1::Argument"*, i64 } }
%"core::fmt::rt::v1::Argument" = type { %"core::fmt::rt::v1::Position", %"core::fmt::rt::v1::FormatSpec" }
%"core::fmt::rt::v1::Position" = type { i64, [0 x i64], [1 x i64] }
%"core::fmt::rt::v1::FormatSpec" = type { i32, i8, i32, %"core::fmt::rt::v1::Count", %"core::fmt::rt::v1::Count" }
%"core::fmt::rt::v1::Count" = type { i64, [0 x i64], [1 x i64] }

!0 = !{i32 1, !"PIE Level", i32 2}
!1 = !{i32 2, !"Dwarf Version", i32 2}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !4, producer: "rustc version 1.16.0-nightly (df8debf6d 2017-01-25)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, globals: !44)
!4 = !DIFile(filename: "./example.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!5 = !{!6, !19, !26, !32, !38}
!6 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Position", scope: !8, file: !7, baseType: !15, size: 64, align: 64, elements: !16)
!7 = !DIFile(filename: "<unknown>", directory: "")
!8 = !DINamespace(name: "v1", scope: !10, file: !9, line: 11)
!9 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/nightly-dist-rustc-mac/build/src/libcore/fmt/rt/v1.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!10 = !DINamespace(name: "rt", scope: !12, file: !11, line: 48)
!11 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/nightly-dist-rustc-mac/build/src/libcore/fmt/mod.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!12 = !DINamespace(name: "fmt", scope: !13, file: !11, line: 11)
!13 = !DINamespace(name: "core", scope: null, file: !14, line: 11)
!14 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/nightly-dist-rustc-mac/build/src/libcore/lib.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!15 = !DIBasicType(name: "u64", size: 64, align: 64, encoding: DW_ATE_unsigned)
!16 = !{!17, !18}
!17 = !DIEnumerator(name: "Next", value: 0)
!18 = !DIEnumerator(name: "At", value: 1)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !8, file: !7, baseType: !20, size: 8, align: 8, elements: !21)
!20 = !DIBasicType(name: "u8", size: 8, align: 8, encoding: DW_ATE_unsigned)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "Left", value: 0)
!23 = !DIEnumerator(name: "Right", value: 1)
!24 = !DIEnumerator(name: "Center", value: 2)
!25 = !DIEnumerator(name: "Unknown", value: 3)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Count", scope: !8, file: !7, baseType: !15, size: 64, align: 64, elements: !27)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "Is", value: 0)
!29 = !DIEnumerator(name: "Param", value: 1)
!30 = !DIEnumerator(name: "NextParam", value: 2)
!31 = !DIEnumerator(name: "Implied", value: 3)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !33, file: !7, baseType: !20, size: 8, align: 8, elements: !35)
!33 = !DINamespace(name: "result", scope: !13, file: !34, line: 11)
!34 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/nightly-dist-rustc-mac/build/src/libcore/result.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!35 = !{!36, !37}
!36 = !DIEnumerator(name: "Ok", value: 0)
!37 = !DIEnumerator(name: "Err", value: 1)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Option", scope: !39, file: !7, baseType: !15, size: 64, align: 64, elements: !41)
!39 = !DINamespace(name: "option", scope: !13, file: !40, line: 11)
!40 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/nightly-dist-rustc-mac/build/src/libcore/option.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!41 = !{!42, !43}
!42 = !DIEnumerator(name: "None", value: 0)
!43 = !DIEnumerator(name: "Some", value: 1)
!44 = !{!45, !61, !69, !71, !73}
!45 = distinct !DIGlobalVariable(name: "__STATIC_FMTSTR", linkageName: "_ZN7example10just_print15__STATIC_FMTSTRE", scope: !46, file: !49, line: 2, type: !50, isLocal: true, isDefinition: true, variable: { %str_slice*, i64 }* @_ZN7example10just_print15__STATIC_FMTSTR17hfecf6bee7dfe61f1E)
!46 = !DINamespace(name: "just_print", scope: !48, file: !47, line: 6)
!47 = !DIFile(filename: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust/example.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!48 = !DINamespace(name: "example", scope: null, file: !47, line: 2)
!49 = !DIFile(filename: "<println macros>", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !7, size: 128, align: 64, elements: !51, identifier: "917281410ef5e94e2a46677205255f3deba10302")
!51 = !{!52, !60}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !50, file: !7, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &str", baseType: !54, size: 64, align: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !7, size: 128, align: 64, elements: !55, identifier: "84d2e8c51a6d51cb9793108c0a4ccc387b029b7c")
!55 = !{!56, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !54, file: !7, baseType: !57, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !20, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !54, file: !7, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIBasicType(name: "usize", size: 64, align: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !50, file: !7, baseType: !59, size: 64, align: 64, offset: 64)
!61 = distinct !DIGlobalVariable(name: "_FILE_LINE", linkageName: "_ZN7example17rusttest_foo_sum110_FILE_LINEE", scope: !62, file: !63, line: 5, type: !64, isLocal: true, isDefinition: true, variable: { %str_slice, i32, [4 x i8] }* @_ZN7example17rusttest_foo_sum110_FILE_LINE17h5d1b4176bce6be50E)
!62 = !DINamespace(name: "rusttest_foo_sum1", scope: !48, file: !47, line: 11)
!63 = !DIFile(filename: "<panic macros>", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&str, u32)", file: !7, size: 192, align: 64, elements: !65, identifier: "7938d327a46fe9a622f4f79da12b5f3b304c40cf")
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !64, file: !7, baseType: !54, size: 128, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !64, file: !7, baseType: !68, size: 32, align: 32, offset: 128)
!68 = !DIBasicType(name: "u32", size: 32, align: 32, encoding: DW_ATE_unsigned)
!69 = distinct !DIGlobalVariable(name: "_FILE_LINE", linkageName: "_ZN7example17rusttest_foo_sum210_FILE_LINEE", scope: !70, file: !63, line: 5, type: !64, isLocal: true, isDefinition: true, variable: { %str_slice, i32, [4 x i8] }* @_ZN7example17rusttest_foo_sum210_FILE_LINE17h1dfc9fa2411661a7E)
!70 = !DINamespace(name: "rusttest_foo_sum2", scope: !48, file: !47, line: 16)
!71 = distinct !DIGlobalVariable(name: "_FILE_LINE", linkageName: "_ZN7example17rusttest_foo_sum310_FILE_LINEE", scope: !72, file: !63, line: 5, type: !64, isLocal: true, isDefinition: true, variable: { %str_slice, i32, [4 x i8] }* @_ZN7example17rusttest_foo_sum310_FILE_LINE17h4364fc82d6a6eaa9E)
!72 = !DINamespace(name: "rusttest_foo_sum3", scope: !48, file: !47, line: 21)
!73 = distinct !DIGlobalVariable(name: "_FILE_LINE", linkageName: "_ZN7example17rusttest_foo_sum410_FILE_LINEE", scope: !74, file: !63, line: 5, type: !64, isLocal: true, isDefinition: true, variable: { %str_slice, i32, [4 x i8] }* @_ZN7example17rusttest_foo_sum410_FILE_LINE17h0d63d900c8521622E)
!74 = !DINamespace(name: "rusttest_foo_sum4", scope: !48, file: !47, line: 26)
!75 = distinct !DISubprogram(name: "get_type_id<&str>", linkageName: "_ZN4core3any8{{impl}}17get_type_id<&str>E", scope: !77, file: !76, line: 115, type: !79, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !85, variables: !87)
!76 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/nightly-dist-rustc-mac/build/src/libcore/any.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!77 = !DINamespace(name: "{{impl}}", scope: !78, file: !76, line: 114)
!78 = !DINamespace(name: "any", scope: !13, file: !76, line: 11)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !84}
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "TypeId", scope: !78, file: !7, size: 64, align: 64, elements: !82, identifier: "f80b8036614d32088aa4b1d82ec3c5b70ca5b200")
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !81, file: !7, baseType: !15, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !54, size: 64, align: 64)
!85 = !{!86}
!86 = !DITemplateTypeParameter(name: "T", type: !54)
!87 = !{}
!88 = !DILocalVariable(name: "self", arg: 1, scope: !75, file: !47, line: 1, type: !84)
!89 = !DIExpression()
!90 = !DILocation(line: 1, scope: !75)
!91 = !DILocalVariable(name: "self", scope: !92, file: !76, line: 115, type: !84)
!92 = distinct !DILexicalBlock(scope: !75, file: !76, line: 115, column: 36)
!93 = !DILocation(line: 115, scope: !92)
!94 = !DILocation(line: 115, scope: !75)
!95 = distinct !DISubprogram(name: "begin_panic<&str>", linkageName: "_ZN3std9panicking17begin_panic<&str>E", scope: !97, file: !96, line: 509, type: !100, isLocal: false, isDefinition: true, scopeLine: 509, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !104, variables: !87)
!96 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/nightly-dist-rustc-mac/build/src/libstd/panicking.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!97 = !DINamespace(name: "panicking", scope: !98, file: !96, line: 11)
!98 = !DINamespace(name: "std", scope: null, file: !99, line: 11)
!99 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/nightly-dist-rustc-mac/build/src/libstd/lib.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !54, !103}
!102 = !DIBasicType(name: "!", align: 8, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(&str, u32)", baseType: !64, size: 64, align: 64)
!104 = !{!105}
!105 = !DITemplateTypeParameter(name: "M", type: !54)
!106 = !DILocalVariable(name: "x", scope: !107, file: !108, line: 234, type: !54)
!107 = distinct !DILexicalBlock(scope: !109, file: !108, line: 234, column: 31)
!108 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/nightly-dist-rustc-mac/build/src/liballoc/boxed.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!109 = distinct !DISubprogram(name: "new<&str>", linkageName: "_ZN5alloc5boxed8{{impl}}9new<&str>E", scope: !110, file: !108, line: 234, type: !114, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !85, variables: !87)
!110 = !DINamespace(name: "{{impl}}", scope: !111, file: !108, line: 224)
!111 = !DINamespace(name: "boxed", scope: !112, file: !108, line: 11)
!112 = !DINamespace(name: "alloc", scope: null, file: !113, line: 11)
!113 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/nightly-dist-rustc-mac/build/src/liballoc/lib.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!114 = !DISubroutineType(types: !115)
!115 = !{!116, !54}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<&str>", baseType: !54, size: 64, align: 64)
!117 = !DILocation(line: 234, scope: !107, inlinedAt: !118)
!118 = distinct !DILocation(line: 517, scope: !119)
!119 = distinct !DILexicalBlock(scope: !95, file: !96, line: 509, column: 80)
!120 = !DILocalVariable(name: "x", arg: 1, scope: !109, file: !47, line: 1, type: !54)
!121 = !DILocation(line: 1, scope: !109, inlinedAt: !118)
!122 = !DILocalVariable(name: "msg", arg: 1, scope: !95, file: !47, line: 1, type: !54)
!123 = !DILocation(line: 1, scope: !95)
!124 = !DILocalVariable(name: "file_line", arg: 2, scope: !95, file: !47, line: 1, type: !103)
!125 = !DILocalVariable(name: "msg", scope: !119, file: !96, line: 509, type: !54)
!126 = !DILocation(line: 509, scope: !119)
!127 = !DILocalVariable(name: "file_line", scope: !119, file: !96, line: 509, type: !103)
!128 = !DILocation(line: 509, scope: !95)
!129 = !DILocation(line: 517, scope: !119)
!130 = !{!131}
!131 = distinct !{!131, !132, !"_ZN5alloc5boxed30_$LT$impl$u20$Box$LT$T$GT$$GT$3new17hcdad80961e4b06cfE: argument 0"}
!132 = distinct !{!132, !"_ZN5alloc5boxed30_$LT$impl$u20$Box$LT$T$GT$$GT$3new17hcdad80961e4b06cfE"}
!133 = !DILocation(line: 234, scope: !109, inlinedAt: !118)
!134 = !DILocation(line: 235, scope: !107, inlinedAt: !118)
!135 = !DILocation(line: 236, scope: !107, inlinedAt: !118)
!136 = distinct !DISubprogram(name: "of<&str>", linkageName: "_ZN4core3any8{{impl}}8of<&str>E", scope: !81, file: !76, line: 366, type: !137, isLocal: false, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !85, variables: !87)
!137 = !DISubroutineType(types: !138)
!138 = !{!81}
!139 = !DILocation(line: 368, scope: !136)
!140 = !DILocation(line: 367, scope: !136)
!141 = !DILocation(line: 370, scope: !136)
!142 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt8{{impl}}6new_v1E", scope: !143, file: !11, line: 241, type: !265, isLocal: false, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !87, variables: !87)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !12, file: !7, size: 384, align: 64, elements: !144, identifier: "03a2b9276c1af18673f619f0170269ab24e4b287")
!144 = !{!145, !146, !201}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !143, file: !7, baseType: !50, size: 128, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !143, file: !7, baseType: !147, size: 128, align: 64, offset: 128)
!147 = !DICompositeType(tag: DW_TAG_union_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !39, file: !7, size: 128, align: 64, elements: !148, identifier: "83ae897c2da7360f57b948af0e05ae299239b723")
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENCODED$ENUM$0$0$None", scope: !147, file: !7, baseType: !150, size: 128, align: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !39, file: !7, size: 128, align: 64, elements: !151, identifier: "83ae897c2da7360f57b948af0e05ae299239b723::Some")
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !150, file: !7, baseType: !153, size: 128, align: 64)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !7, size: 128, align: 64, elements: !154, identifier: "1e89121dabcb7d95fed250c0f453e569d8b275f7")
!154 = !{!155, !200}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !153, file: !7, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::fmt::rt::v1::Argument", baseType: !157, size: 64, align: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !8, file: !7, size: 512, align: 64, elements: !158, identifier: "15f214ce3d278b08e5f0235ae22dbc64ded5b552")
!158 = !{!159, !171}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !157, file: !7, baseType: !160, size: 128, align: 64)
!160 = !DICompositeType(tag: DW_TAG_union_type, name: "Position", scope: !8, file: !7, size: 128, align: 64, elements: !161, identifier: "9157f22abd01255c448b8ba3c084c77149f50141")
!161 = !{!162, !166}
!162 = !DIDerivedType(tag: DW_TAG_member, scope: !160, file: !7, baseType: !163, size: 64, align: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "Next", scope: !8, file: !7, size: 64, align: 64, elements: !164, identifier: "9157f22abd01255c448b8ba3c084c77149f50141::Next")
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !163, file: !7, baseType: !6, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, scope: !160, file: !7, baseType: !167, size: 128, align: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "At", scope: !8, file: !7, size: 128, align: 64, elements: !168, identifier: "9157f22abd01255c448b8ba3c084c77149f50141::At")
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !167, file: !7, baseType: !6, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !167, file: !7, baseType: !59, size: 64, align: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !157, file: !7, baseType: !172, size: 384, align: 64, offset: 128)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !8, file: !7, size: 384, align: 64, elements: !173, identifier: "e3e6aac5434e0bb258ad6e21fda200287eb0bec4")
!173 = !{!174, !176, !177, !178, !199}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !172, file: !7, baseType: !175, size: 32, align: 32)
!175 = !DIBasicType(name: "char", size: 32, align: 32, encoding: DW_ATE_unsigned_char)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !172, file: !7, baseType: !19, size: 8, align: 8, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !172, file: !7, baseType: !68, size: 32, align: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !172, file: !7, baseType: !179, size: 128, align: 64, offset: 128)
!179 = !DICompositeType(tag: DW_TAG_union_type, name: "Count", scope: !8, file: !7, size: 128, align: 64, elements: !180, identifier: "98a95e281b454adec81834f41627f9e78e47dd7b")
!180 = !{!181, !186, !191, !195}
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !179, file: !7, baseType: !182, size: 128, align: 64)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !8, file: !7, size: 128, align: 64, elements: !183, identifier: "98a95e281b454adec81834f41627f9e78e47dd7b::Is")
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !182, file: !7, baseType: !26, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !182, file: !7, baseType: !59, size: 64, align: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, scope: !179, file: !7, baseType: !187, size: 128, align: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !8, file: !7, size: 128, align: 64, elements: !188, identifier: "98a95e281b454adec81834f41627f9e78e47dd7b::Param")
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !187, file: !7, baseType: !26, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !187, file: !7, baseType: !59, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !179, file: !7, baseType: !192, size: 64, align: 64)
!192 = !DICompositeType(tag: DW_TAG_structure_type, name: "NextParam", scope: !8, file: !7, size: 64, align: 64, elements: !193, identifier: "98a95e281b454adec81834f41627f9e78e47dd7b::NextParam")
!193 = !{!194}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !192, file: !7, baseType: !26, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, scope: !179, file: !7, baseType: !196, size: 64, align: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !8, file: !7, size: 64, align: 64, elements: !197, identifier: "98a95e281b454adec81834f41627f9e78e47dd7b::Implied")
!197 = !{!198}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !196, file: !7, baseType: !26, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !172, file: !7, baseType: !179, size: 128, align: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !153, file: !7, baseType: !59, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !143, file: !7, baseType: !202, size: 128, align: 64, offset: 256)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !7, size: 128, align: 64, elements: !203, identifier: "292920607dfcb2ae088d2412e42b155d03690083")
!203 = !{!204, !264}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !202, file: !7, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::fmt::ArgumentV1", baseType: !206, size: 64, align: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !12, file: !7, size: 128, align: 64, elements: !207, identifier: "fe09d81277025ddabebf426c15d1b71f796b6f47")
!207 = !{!208, !214}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !206, file: !7, baseType: !209, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Void", baseType: !210, size: 64, align: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Void", scope: !12, file: !7, align: 8, elements: !211, identifier: "d97a49abe0605b256a8bcf0bf18cb19faeec5ca8")
!211 = !{!212}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_priv", scope: !210, file: !7, baseType: !213, align: 8)
!213 = !DIBasicType(name: "()", align: 8, encoding: DW_ATE_unsigned)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !206, file: !7, baseType: !215, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::Void, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !209, !231}
!218 = !DICompositeType(tag: DW_TAG_union_type, name: "Result<(), core::fmt::Error>", scope: !33, file: !7, size: 8, align: 8, elements: !219, identifier: "ac648fea8d2f19967ee6c75bdbd71182aa7ee657")
!219 = !{!220, !225}
!220 = !DIDerivedType(tag: DW_TAG_member, scope: !218, file: !7, baseType: !221, size: 8, align: 8)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !33, file: !7, size: 8, align: 8, elements: !222, identifier: "ac648fea8d2f19967ee6c75bdbd71182aa7ee657::Ok")
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !221, file: !7, baseType: !32, size: 8, align: 8)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !221, file: !7, baseType: !213, align: 8, offset: 8)
!225 = !DIDerivedType(tag: DW_TAG_member, scope: !218, file: !7, baseType: !226, size: 8, align: 8)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !33, file: !7, size: 8, align: 8, elements: !227, identifier: "ac648fea8d2f19967ee6c75bdbd71182aa7ee657::Err")
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !226, file: !7, baseType: !32, size: 8, align: 8)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !226, file: !7, baseType: !230, align: 8, offset: 8)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !12, file: !7, align: 8, elements: !87, identifier: "3403eabdee83e648cb83f839f301345ebc2dd847")
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !232, size: 64, align: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !12, file: !7, size: 768, align: 64, elements: !233, identifier: "4c2f48cbe2db942349d64f8d4fde6f689a429548")
!233 = !{!234, !235, !236, !237, !249, !250, !252, !263}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !232, file: !7, baseType: !68, size: 32, align: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !232, file: !7, baseType: !175, size: 32, align: 32, offset: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !232, file: !7, baseType: !19, size: 8, align: 8, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !232, file: !7, baseType: !238, size: 128, align: 64, offset: 128)
!238 = !DICompositeType(tag: DW_TAG_union_type, name: "Option<usize>", scope: !39, file: !7, size: 128, align: 64, elements: !239, identifier: "fd6e4e9ec5a95550b3c9dd6a3d0d3a972e43f9e8")
!239 = !{!240, !244}
!240 = !DIDerivedType(tag: DW_TAG_member, scope: !238, file: !7, baseType: !241, size: 64, align: 64)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !39, file: !7, size: 64, align: 64, elements: !242, identifier: "fd6e4e9ec5a95550b3c9dd6a3d0d3a972e43f9e8::None")
!242 = !{!243}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !241, file: !7, baseType: !38, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, scope: !238, file: !7, baseType: !245, size: 128, align: 64)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !39, file: !7, size: 128, align: 64, elements: !246, identifier: "fd6e4e9ec5a95550b3c9dd6a3d0d3a972e43f9e8::Some")
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !245, file: !7, baseType: !38, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !245, file: !7, baseType: !59, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !232, file: !7, baseType: !238, size: 128, align: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !232, file: !7, baseType: !251, size: 128, align: 64, offset: 384)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut Write", scope: !12, file: !7, size: 128, align: 64, elements: !87, identifier: "f415d9e7bd492f2f756cd59aa02ff5c10c31ca09")
!252 = !DIDerivedType(tag: DW_TAG_member, name: "curarg", scope: !232, file: !7, baseType: !253, size: 128, align: 64, offset: 512)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<core::fmt::ArgumentV1>", scope: !254, file: !7, size: 128, align: 64, elements: !256, identifier: "53ac355ccc0758e9513421a5c7b663b0a080d581")
!254 = !DINamespace(name: "slice", scope: !13, file: !255, line: 11)
!255 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/nightly-dist-rustc-mac/build/src/libcore/slice.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!256 = !{!257, !258, !259}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !253, file: !7, baseType: !205, size: 64, align: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !253, file: !7, baseType: !205, size: 64, align: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !253, file: !7, baseType: !260, align: 8, offset: 128)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&core::fmt::ArgumentV1>", scope: !261, file: !7, align: 8, elements: !87, identifier: "5b290e32826477f2be72665320e3c39e3caa5a56")
!261 = !DINamespace(name: "marker", scope: !13, file: !262, line: 11)
!262 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/nightly-dist-rustc-mac/build/src/libcore/marker.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!263 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !232, file: !7, baseType: !202, size: 128, align: 64, offset: 640)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !202, file: !7, baseType: !59, size: 64, align: 64, offset: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{!143, !50, !202}
!267 = !DILocalVariable(name: "pieces", arg: 1, scope: !142, file: !47, line: 1, type: !50)
!268 = !DILocation(line: 1, scope: !142)
!269 = !DILocalVariable(name: "args", arg: 2, scope: !142, file: !47, line: 1, type: !202)
!270 = !DILocalVariable(name: "pieces", scope: !271, file: !11, line: 241, type: !50)
!271 = distinct !DILexicalBlock(scope: !142, file: !11, line: 242, column: 63)
!272 = !DILocation(line: 241, scope: !271)
!273 = !DILocalVariable(name: "args", scope: !271, file: !11, line: 242, type: !202)
!274 = !DILocation(line: 242, scope: !271)
!275 = !DILocation(line: 241, scope: !142)
!276 = !DILocation(line: 242, scope: !142)
!277 = !DILocation(line: 244, scope: !271)
!278 = !DILocation(line: 245, scope: !271)
!279 = !DILocation(line: 246, scope: !271)
!280 = !DILocation(line: 243, scope: !271)
!281 = !DILocation(line: 248, scope: !271)
!282 = distinct !DISubprogram(name: "is_null<u8>", linkageName: "_ZN4core3ptr8{{impl}}11is_null<u8>E", scope: !284, file: !283, line: 490, type: !286, isLocal: false, isDefinition: true, scopeLine: 490, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !290, variables: !87)
!283 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/nightly-dist-rustc-mac/build/src/libcore/ptr.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!284 = !DINamespace(name: "{{impl}}", scope: !285, file: !283, line: 476)
!285 = !DINamespace(name: "ptr", scope: !13, file: !283, line: 13)
!286 = !DISubroutineType(types: !287)
!287 = !{!288, !289}
!288 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !20, size: 64, align: 64)
!290 = !{!291}
!291 = !DITemplateTypeParameter(name: "T", type: !20)
!292 = !DILocalVariable(name: "self", arg: 1, scope: !282, file: !47, line: 1, type: !289)
!293 = !DILocation(line: 1, scope: !282)
!294 = !DILocalVariable(name: "self", scope: !295, file: !283, line: 490, type: !289)
!295 = distinct !DILexicalBlock(scope: !282, file: !283, line: 490, column: 48)
!296 = !DILocation(line: 490, scope: !295)
!297 = !DILocation(line: 490, scope: !282)
!298 = !DILocation(line: 491, scope: !295)
!299 = !DILocation(line: 492, scope: !295)
!300 = distinct !DISubprogram(name: "null_mut<u8>", linkageName: "_ZN4core3ptr12null_mut<u8>E", scope: !285, file: !283, line: 69, type: !301, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !290, variables: !87)
!301 = !DISubroutineType(types: !302)
!302 = !{!289}
!303 = !DILocation(line: 69, scope: !300)
!304 = distinct !DISubprogram(name: "exchange_malloc", linkageName: "_ZN5alloc4heap15exchange_mallocE", scope: !306, file: !305, line: 134, type: !307, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !87, variables: !87)
!305 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/nightly-dist-rustc-mac/build/src/liballoc/heap.rs", directory: "/Users/stanislaw/Projects/LLVM/llvm/projects/mull/lab/rust")
!306 = !DINamespace(name: "heap", scope: !112, file: !305, line: 11)
!307 = !DISubroutineType(types: !308)
!308 = !{!289, !59, !59}
!309 = !DILocalVariable(name: "size", arg: 1, scope: !304, file: !47, line: 1, type: !59)
!310 = !DILocation(line: 1, scope: !304)
!311 = !DILocalVariable(name: "align", arg: 2, scope: !304, file: !47, line: 1, type: !59)
!312 = !DILocalVariable(name: "size", scope: !313, file: !305, line: 134, type: !59)
!313 = distinct !DILexicalBlock(scope: !304, file: !305, line: 134, column: 64)
!314 = !DILocation(line: 134, scope: !313)
!315 = !DILocalVariable(name: "align", scope: !313, file: !305, line: 134, type: !59)
