; ModuleID = 'example.cgu-0.rs'
source_filename = "example.cgu-0.rs"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-darwin"

%str_slice = type { i8*, i64 }
%"2.std::fmt::ArgumentV1" = type { %"2.core::fmt::Void"*, i8 (%"2.core::fmt::Void"*, %"2.std::fmt::Formatter"*)* }
%"2.core::fmt::Void" = type {}
%"2.std::fmt::Formatter" = type { i32, i32, i8, %"2.std::option::Option<usize>", %"2.std::option::Option<usize>", { i8*, void (i8*)** }, %"2.std::slice::Iter<std::fmt::ArgumentV1>", { %"2.std::fmt::ArgumentV1"*, i64 } }
%"2.std::option::Option<usize>" = type { i64, [0 x i64], [1 x i64] }
%"2.std::slice::Iter<std::fmt::ArgumentV1>" = type { %"2.std::fmt::ArgumentV1"*, %"2.std::fmt::ArgumentV1"*, %"2.std::marker::PhantomData<&std::fmt::ArgumentV1>" }
%"2.std::marker::PhantomData<&std::fmt::ArgumentV1>" = type {}
%"2.std::any::TypeId" = type { i64 }
%"2.std::fmt::Arguments" = type { { %str_slice*, i64 }, %"2.std::option::Option<&[std::fmt::rt::v1::Argument]>", { %"2.std::fmt::ArgumentV1"*, i64 } }
%"2.std::option::Option<&[std::fmt::rt::v1::Argument]>" = type { { %"2.std::fmt::rt::v1::Argument"*, i64 } }
%"2.std::fmt::rt::v1::Argument" = type { %"2.std::fmt::rt::v1::Position", %"2.std::fmt::rt::v1::FormatSpec" }
%"2.std::fmt::rt::v1::Position" = type { i64, [0 x i64], [1 x i64] }
%"2.std::fmt::rt::v1::FormatSpec" = type { i32, i8, i32, %"2.std::fmt::rt::v1::Count", %"2.std::fmt::rt::v1::Count" }

!0 = !{i32 1, !"PIE Level", i32 2}
!1 = !{i32 2, !"Dwarf Version", i32 2}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !4, producer: "rustc version 1.14.0 (e8a012324 2016-12-16)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !5, globals: !39)
!4 = !DIFile(filename: "./example.rs", directory: "/Users/stanislaw/Projects/mull/lab/rust")
!5 = !{!6, !16, !23, !29, !34}
!6 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Position", scope: !8, file: !7, baseType: !12, size: 64, align: 64, elements: !13)
!7 = !DIFile(filename: "<unknown>", directory: "")
!8 = !DINamespace(name: "v1", scope: !9, file: !7)
!9 = !DINamespace(name: "rt", scope: !10, file: !7)
!10 = !DINamespace(name: "fmt", scope: !11, file: !7)
!11 = !DINamespace(name: "core", scope: null, file: !7)
!12 = !DIBasicType(name: "u64", size: 64, align: 64, encoding: DW_ATE_unsigned)
!13 = !{!14, !15}
!14 = !DIEnumerator(name: "Next", value: 0)
!15 = !DIEnumerator(name: "At", value: 1)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !8, file: !7, baseType: !17, size: 8, align: 8, elements: !18)
!17 = !DIBasicType(name: "u8", size: 8, align: 8, encoding: DW_ATE_unsigned)
!18 = !{!19, !20, !21, !22}
!19 = !DIEnumerator(name: "Left", value: 0)
!20 = !DIEnumerator(name: "Right", value: 1)
!21 = !DIEnumerator(name: "Center", value: 2)
!22 = !DIEnumerator(name: "Unknown", value: 3)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Count", scope: !8, file: !7, baseType: !12, size: 64, align: 64, elements: !24)
!24 = !{!25, !26, !27, !28}
!25 = !DIEnumerator(name: "Is", value: 0)
!26 = !DIEnumerator(name: "Param", value: 1)
!27 = !DIEnumerator(name: "NextParam", value: 2)
!28 = !DIEnumerator(name: "Implied", value: 3)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !30, file: !7, baseType: !17, size: 8, align: 8, elements: !31)
!30 = !DINamespace(name: "result", scope: !11, file: !7)
!31 = !{!32, !33}
!32 = !DIEnumerator(name: "Ok", value: 0)
!33 = !DIEnumerator(name: "Err", value: 1)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Option", scope: !35, file: !7, baseType: !12, size: 64, align: 64, elements: !36)
!35 = !DINamespace(name: "option", scope: !11, file: !7)
!36 = !{!37, !38}
!37 = !DIEnumerator(name: "None", value: 0)
!38 = !DIEnumerator(name: "Some", value: 1)
!39 = !{!40, !56, !63, !65, !67}
!40 = distinct !DIGlobalVariable(name: "__STATIC_FMTSTR", linkageName: "_ZN7example10just_print15__STATIC_FMTSTRE", scope: !41, file: !44, line: 2, type: !45, isLocal: true, isDefinition: true, variable: { %str_slice*, i64 }* @_ZN7example10just_print15__STATIC_FMTSTR17hd8f4a8b1a7bd93feE)
!41 = !DINamespace(name: "just_print", scope: !43, file: !42, line: 6)
!42 = !DIFile(filename: "/Users/stanislaw/Projects/mull/lab/rust/example.rs", directory: "/Users/stanislaw/Projects/mull/lab/rust")
!43 = !DINamespace(name: "example", scope: null, file: !7)
!44 = !DIFile(filename: "<std macros>", directory: "/Users/stanislaw/Projects/mull/lab/rust")
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !7, size: 128, align: 64, elements: !46, identifier: "feaae0c54c7c7da1c9df23d36eb11d9c3735aa")
!46 = !{!47, !55}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !45, file: !7, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &str", baseType: !49, size: 64, align: 64)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !7, size: 128, align: 64, elements: !50, identifier: "ba943fec7ffec6f5b5383b3687bffbb545ec77f")
!50 = !{!51, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !49, file: !7, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !17, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !49, file: !7, baseType: !54, size: 64, align: 64, offset: 64)
!54 = !DIBasicType(name: "usize", size: 64, align: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !45, file: !7, baseType: !54, size: 64, align: 64, offset: 64)
!56 = distinct !DIGlobalVariable(name: "_FILE_LINE", linkageName: "_ZN7example17rusttest_foo_sum110_FILE_LINEE", scope: !57, file: !44, line: 5, type: !58, isLocal: true, isDefinition: true, variable: { %str_slice, i32, [4 x i8] }* @_ZN7example17rusttest_foo_sum110_FILE_LINE17hc8287d48fb620a31E)
!57 = !DINamespace(name: "rusttest_foo_sum1", scope: !43, file: !42, line: 11)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&str, u32)", file: !7, size: 192, align: 64, elements: !59, identifier: "c5cde3a439cadccb7a27333adc9bf57da4510cb")
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !58, file: !7, baseType: !49, size: 128, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !58, file: !7, baseType: !62, size: 32, align: 32, offset: 128)
!62 = !DIBasicType(name: "u32", size: 32, align: 32, encoding: DW_ATE_unsigned)
!63 = distinct !DIGlobalVariable(name: "_FILE_LINE", linkageName: "_ZN7example17rusttest_foo_sum210_FILE_LINEE", scope: !64, file: !44, line: 5, type: !58, isLocal: true, isDefinition: true, variable: { %str_slice, i32, [4 x i8] }* @_ZN7example17rusttest_foo_sum210_FILE_LINE17h4d705b6f32c12b79E)
!64 = !DINamespace(name: "rusttest_foo_sum2", scope: !43, file: !42, line: 16)
!65 = distinct !DIGlobalVariable(name: "_FILE_LINE", linkageName: "_ZN7example17rusttest_foo_sum310_FILE_LINEE", scope: !66, file: !44, line: 5, type: !58, isLocal: true, isDefinition: true, variable: { %str_slice, i32, [4 x i8] }* @_ZN7example17rusttest_foo_sum310_FILE_LINE17h8fbd632de25157e2E)
!66 = !DINamespace(name: "rusttest_foo_sum3", scope: !43, file: !42, line: 21)
!67 = distinct !DIGlobalVariable(name: "_FILE_LINE", linkageName: "_ZN7example17rusttest_foo_sum410_FILE_LINEE", scope: !68, file: !44, line: 5, type: !58, isLocal: true, isDefinition: true, variable: { %str_slice, i32, [4 x i8] }* @_ZN7example17rusttest_foo_sum410_FILE_LINE17he7849d355e168406E)
!68 = !DINamespace(name: "rusttest_foo_sum4", scope: !43, file: !42, line: 26)
!69 = distinct !DISubprogram(name: "get_type_id<&str>", linkageName: "_ZN4core3any8{{impl}}17get_type_id<&str>E", scope: !71, file: !70, line: 115, type: !73, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !79, variables: !81)
!70 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/stable-dist-rustc-mac/build/obj/../src/libcore/any.rs", directory: "/Users/stanislaw/Projects/mull/lab/rust")
!71 = !DINamespace(name: "{{impl}}", scope: !72, file: !7)
!72 = !DINamespace(name: "any", scope: !11, file: !7)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !78}
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "TypeId", scope: !72, file: !7, size: 64, align: 64, elements: !76, identifier: "bf7d48731e03b6e1cedb66ee729d6c6f41787c")
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !75, file: !7, baseType: !12, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !49, size: 64, align: 64)
!79 = !{!80}
!80 = !DITemplateTypeParameter(name: "T", type: !49)
!81 = !{}
!82 = !DILocalVariable(name: "self", arg: 1, scope: !69, file: !42, line: 1, type: !78)
!83 = !DIExpression()
!84 = !DILocation(line: 1, scope: !69)
!85 = !DILocalVariable(name: "self", scope: !86, file: !70, line: 115, type: !78)
!86 = distinct !DILexicalBlock(scope: !69, file: !70, line: 115, column: 36)
!87 = !DILocation(line: 115, scope: !86)
!88 = !DILocation(line: 115, scope: !69)
!89 = distinct !DISubprogram(name: "begin_panic<&str>", linkageName: "_ZN3std9panicking17begin_panic<&str>E", scope: !91, file: !90, line: 405, type: !93, isLocal: false, isDefinition: true, scopeLine: 405, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !97, variables: !81)
!90 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/stable-dist-rustc-mac/build/obj/../src/libstd/panicking.rs", directory: "/Users/stanislaw/Projects/mull/lab/rust")
!91 = !DINamespace(name: "panicking", scope: !92, file: !7)
!92 = !DINamespace(name: "std", scope: null, file: !7)
!93 = !DISubroutineType(types: !94)
!94 = !{!95, !49, !96}
!95 = !DIBasicType(name: "!", align: 8, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(&str, u32)", baseType: !58, size: 64, align: 64)
!97 = !{!98}
!98 = !DITemplateTypeParameter(name: "M", type: !49)
!99 = !DILocalVariable(name: "x", arg: 1, scope: !100, file: !42, line: 1, type: !49)
!100 = distinct !DISubprogram(name: "new<&str>", linkageName: "_ZN5alloc5boxed8{{impl}}9new<&str>E", scope: !102, file: !101, line: 234, type: !105, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !79, variables: !81)
!101 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/stable-dist-rustc-mac/build/obj/../src/liballoc/boxed.rs", directory: "/Users/stanislaw/Projects/mull/lab/rust")
!102 = !DINamespace(name: "{{impl}}", scope: !103, file: !7)
!103 = !DINamespace(name: "boxed", scope: !104, file: !7)
!104 = !DINamespace(name: "alloc", scope: null, file: !7)
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !49}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<&str>", baseType: !49, size: 64, align: 64)
!108 = !DILocation(line: 1, scope: !100, inlinedAt: !109)
!109 = distinct !DILocation(line: 413, scope: !110)
!110 = distinct !DILexicalBlock(scope: !89, file: !90, line: 405, column: 80)
!111 = !DILocalVariable(name: "x", scope: !112, file: !101, line: 234, type: !49)
!112 = distinct !DILexicalBlock(scope: !100, file: !101, line: 234, column: 31)
!113 = !DILocation(line: 234, scope: !112, inlinedAt: !109)
!114 = !DILocalVariable(name: "msg", arg: 1, scope: !89, file: !42, line: 1, type: !49)
!115 = !DILocation(line: 1, scope: !89)
!116 = !DILocalVariable(name: "file_line", arg: 2, scope: !89, file: !42, line: 1, type: !96)
!117 = !DILocalVariable(name: "msg", scope: !110, file: !90, line: 405, type: !49)
!118 = !DILocation(line: 405, scope: !110)
!119 = !DILocalVariable(name: "file_line", scope: !110, file: !90, line: 405, type: !96)
!120 = !DILocation(line: 405, scope: !89)
!121 = !DILocation(line: 413, scope: !110)
!122 = !{!123}
!123 = distinct !{!123, !124, !"_ZN5alloc5boxed30_$LT$impl$u20$Box$LT$T$GT$$GT$3new17h206de9ebd9c06f29E: argument 0"}
!124 = distinct !{!124, !"_ZN5alloc5boxed30_$LT$impl$u20$Box$LT$T$GT$$GT$3new17h206de9ebd9c06f29E"}
!125 = !DILocation(line: 234, scope: !100, inlinedAt: !109)
!126 = !DILocation(line: 235, scope: !112, inlinedAt: !109)
!127 = !DILocation(line: 236, scope: !112, inlinedAt: !109)
!128 = distinct !DISubprogram(name: "of<&str>", linkageName: "_ZN4core3any8{{impl}}8of<&str>E", scope: !75, file: !70, line: 366, type: !129, isLocal: false, isDefinition: true, scopeLine: 366, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !79, variables: !81)
!129 = !DISubroutineType(types: !130)
!130 = !{!75}
!131 = !DILocation(line: 368, scope: !128)
!132 = !DILocation(line: 367, scope: !128)
!133 = !DILocation(line: 370, scope: !128)
!134 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt8{{impl}}6new_v1E", scope: !136, file: !135, line: 239, type: !254, isLocal: false, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !81, variables: !81)
!135 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/stable-dist-rustc-mac/build/obj/../src/libcore/fmt/mod.rs", directory: "/Users/stanislaw/Projects/mull/lab/rust")
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !10, file: !7, size: 384, align: 64, elements: !137, identifier: "83eb9ebabf3f6fd0ae2a6cdeba793e0a38addaf")
!137 = !{!138, !139, !194}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !136, file: !7, baseType: !45, size: 128, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !136, file: !7, baseType: !140, size: 128, align: 64, offset: 128)
!140 = !DICompositeType(tag: DW_TAG_union_type, name: "Option<&[core::fmt::rt::v1::Argument]>", scope: !35, file: !7, size: 128, align: 64, elements: !141, identifier: "58737646dd18f2444d696745ac24cfb8fffb2b38")
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENCODED$ENUM$0$0$None", scope: !140, file: !7, baseType: !143, size: 128, align: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !35, file: !7, size: 128, align: 64, elements: !144, identifier: "58737646dd18f2444d696745ac24cfb8fffb2b38::Some")
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !143, file: !7, baseType: !146, size: 128, align: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::v1::Argument]", file: !7, size: 128, align: 64, elements: !147, identifier: "acb8b59b13b7737d210a6a244dc43df3c1186c1")
!147 = !{!148, !193}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !146, file: !7, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::fmt::rt::v1::Argument", baseType: !150, size: 64, align: 64)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !8, file: !7, size: 512, align: 64, elements: !151, identifier: "87bca496c14e542a10853af2b39e8fc9e50ce67")
!151 = !{!152, !164}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !150, file: !7, baseType: !153, size: 128, align: 64)
!153 = !DICompositeType(tag: DW_TAG_union_type, name: "Position", scope: !8, file: !7, size: 128, align: 64, elements: !154, identifier: "ad2e9748a4bf9a9a08f853bbce3267761a9fa")
!154 = !{!155, !159}
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !153, file: !7, baseType: !156, size: 64, align: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "Next", scope: !8, file: !7, size: 64, align: 64, elements: !157, identifier: "ad2e9748a4bf9a9a08f853bbce3267761a9fa::Next")
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !156, file: !7, baseType: !6, size: 64, align: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, scope: !153, file: !7, baseType: !160, size: 128, align: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "At", scope: !8, file: !7, size: 128, align: 64, elements: !161, identifier: "ad2e9748a4bf9a9a08f853bbce3267761a9fa::At")
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !160, file: !7, baseType: !6, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !160, file: !7, baseType: !54, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !150, file: !7, baseType: !165, size: 384, align: 64, offset: 128)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !8, file: !7, size: 384, align: 64, elements: !166, identifier: "6df852494a4ba5a76ea4b195c29c7e79b25eada")
!166 = !{!167, !169, !170, !171, !192}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !165, file: !7, baseType: !168, size: 32, align: 32)
!168 = !DIBasicType(name: "char", size: 32, align: 32, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !165, file: !7, baseType: !16, size: 8, align: 8, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !165, file: !7, baseType: !62, size: 32, align: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !165, file: !7, baseType: !172, size: 128, align: 64, offset: 128)
!172 = !DICompositeType(tag: DW_TAG_union_type, name: "Count", scope: !8, file: !7, size: 128, align: 64, elements: !173, identifier: "8da902bdb75d2893298ccedef93a1d21d8d3f")
!173 = !{!174, !179, !184, !188}
!174 = !DIDerivedType(tag: DW_TAG_member, scope: !172, file: !7, baseType: !175, size: 128, align: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !8, file: !7, size: 128, align: 64, elements: !176, identifier: "8da902bdb75d2893298ccedef93a1d21d8d3f::Is")
!176 = !{!177, !178}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !175, file: !7, baseType: !23, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !175, file: !7, baseType: !54, size: 64, align: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, scope: !172, file: !7, baseType: !180, size: 128, align: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !8, file: !7, size: 128, align: 64, elements: !181, identifier: "8da902bdb75d2893298ccedef93a1d21d8d3f::Param")
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !180, file: !7, baseType: !23, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !180, file: !7, baseType: !54, size: 64, align: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !172, file: !7, baseType: !185, size: 64, align: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "NextParam", scope: !8, file: !7, size: 64, align: 64, elements: !186, identifier: "8da902bdb75d2893298ccedef93a1d21d8d3f::NextParam")
!186 = !{!187}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !185, file: !7, baseType: !23, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, scope: !172, file: !7, baseType: !189, size: 64, align: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !8, file: !7, size: 64, align: 64, elements: !190, identifier: "8da902bdb75d2893298ccedef93a1d21d8d3f::Implied")
!190 = !{!191}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !189, file: !7, baseType: !23, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !165, file: !7, baseType: !172, size: 128, align: 64, offset: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !146, file: !7, baseType: !54, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !136, file: !7, baseType: !195, size: 128, align: 64, offset: 256)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::ArgumentV1]", file: !7, size: 128, align: 64, elements: !196, identifier: "470f5eb0ba677a93b32e6f67e9e83e903326e2")
!196 = !{!197, !253}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !195, file: !7, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const core::fmt::ArgumentV1", baseType: !199, size: 64, align: 64)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !10, file: !7, size: 128, align: 64, elements: !200, identifier: "4bf9de4540781d34a8cac17a87461583c1e857")
!200 = !{!201, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !199, file: !7, baseType: !202, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Void", baseType: !203, size: 64, align: 64)
!203 = !DICompositeType(tag: DW_TAG_union_type, name: "Void", scope: !10, file: !7, align: 8, elements: !81, identifier: "971a41309d713671d727b51cdfe21c17b550cf")
!204 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !199, file: !7, baseType: !205, size: 64, align: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::Void, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!208, !202, !222}
!208 = !DICompositeType(tag: DW_TAG_union_type, name: "Result<(), core::fmt::Error>", scope: !30, file: !7, size: 8, align: 8, elements: !209, identifier: "844f18f8851d103a5327b8e997962573faa53d9e")
!209 = !{!210, !216}
!210 = !DIDerivedType(tag: DW_TAG_member, scope: !208, file: !7, baseType: !211, size: 8, align: 8)
!211 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !30, file: !7, size: 8, align: 8, elements: !212, identifier: "844f18f8851d103a5327b8e997962573faa53d9e::Ok")
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !211, file: !7, baseType: !29, size: 8, align: 8)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !211, file: !7, baseType: !215, align: 8, offset: 8)
!215 = !DIBasicType(name: "()", align: 8, encoding: DW_ATE_unsigned)
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !208, file: !7, baseType: !217, size: 8, align: 8)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !30, file: !7, size: 8, align: 8, elements: !218, identifier: "844f18f8851d103a5327b8e997962573faa53d9e::Err")
!218 = !{!219, !220}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !217, file: !7, baseType: !29, size: 8, align: 8)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !217, file: !7, baseType: !221, align: 8, offset: 8)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !10, file: !7, align: 8, elements: !81, identifier: "6ec6ef1d1538ee3cd7f516992793a08620bcc")
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !223, size: 64, align: 64)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !10, file: !7, size: 768, align: 64, elements: !224, identifier: "463d47a191b3ab0743ad18bc68d476df6fa56a")
!224 = !{!225, !226, !227, !228, !240, !241, !243, !252}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !7, baseType: !62, size: 32, align: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !223, file: !7, baseType: !168, size: 32, align: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !223, file: !7, baseType: !16, size: 8, align: 8, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !223, file: !7, baseType: !229, size: 128, align: 64, offset: 128)
!229 = !DICompositeType(tag: DW_TAG_union_type, name: "Option<usize>", scope: !35, file: !7, size: 128, align: 64, elements: !230, identifier: "b345589ef2841a1b12bc86f407f9ce3ef8d1468")
!230 = !{!231, !235}
!231 = !DIDerivedType(tag: DW_TAG_member, scope: !229, file: !7, baseType: !232, size: 64, align: 64)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !35, file: !7, size: 64, align: 64, elements: !233, identifier: "b345589ef2841a1b12bc86f407f9ce3ef8d1468::None")
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !232, file: !7, baseType: !34, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !229, file: !7, baseType: !236, size: 128, align: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !35, file: !7, size: 128, align: 64, elements: !237, identifier: "b345589ef2841a1b12bc86f407f9ce3ef8d1468::Some")
!237 = !{!238, !239}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "RUST$ENUM$DISR", scope: !236, file: !7, baseType: !34, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !236, file: !7, baseType: !54, size: 64, align: 64, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !223, file: !7, baseType: !229, size: 128, align: 64, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !223, file: !7, baseType: !242, size: 128, align: 64, offset: 384)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut Write", scope: !10, file: !7, size: 128, align: 64, elements: !81, identifier: "d5fcd5e514931588789147f514e06e82c192bf")
!243 = !DIDerivedType(tag: DW_TAG_member, name: "curarg", scope: !223, file: !7, baseType: !244, size: 128, align: 64, offset: 512)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<core::fmt::ArgumentV1>", scope: !245, file: !7, size: 128, align: 64, elements: !246, identifier: "ea47deb041936c5471b78333e5fe2719f70c084")
!245 = !DINamespace(name: "slice", scope: !11, file: !7)
!246 = !{!247, !248, !249}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !244, file: !7, baseType: !198, size: 64, align: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !244, file: !7, baseType: !198, size: 64, align: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !244, file: !7, baseType: !250, align: 8, offset: 128)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&core::fmt::ArgumentV1>", scope: !251, file: !7, align: 8, elements: !81, identifier: "ba419515969f2a8a1c712f0bc8abc41dbebe8c8")
!251 = !DINamespace(name: "marker", scope: !11, file: !7)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !223, file: !7, baseType: !195, size: 128, align: 64, offset: 640)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !195, file: !7, baseType: !54, size: 64, align: 64, offset: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!136, !45, !195}
!256 = !DILocalVariable(name: "pieces", arg: 1, scope: !134, file: !42, line: 1, type: !45)
!257 = !DILocation(line: 1, scope: !134)
!258 = !DILocalVariable(name: "args", arg: 2, scope: !134, file: !42, line: 1, type: !195)
!259 = !DILocalVariable(name: "pieces", scope: !260, file: !135, line: 239, type: !45)
!260 = distinct !DILexicalBlock(scope: !134, file: !135, line: 240, column: 63)
!261 = !DILocation(line: 239, scope: !260)
!262 = !DILocalVariable(name: "args", scope: !260, file: !135, line: 240, type: !195)
!263 = !DILocation(line: 240, scope: !260)
!264 = !DILocation(line: 239, scope: !134)
!265 = !DILocation(line: 240, scope: !134)
!266 = !DILocation(line: 242, scope: !260)
!267 = !DILocation(line: 243, scope: !260)
!268 = !DILocation(line: 244, scope: !260)
!269 = !DILocation(line: 241, scope: !260)
!270 = !DILocation(line: 246, scope: !260)
!271 = distinct !DISubprogram(name: "is_null<u8>", linkageName: "_ZN4core3ptr8{{impl}}11is_null<u8>E", scope: !273, file: !272, line: 404, type: !275, isLocal: false, isDefinition: true, scopeLine: 404, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !279, variables: !81)
!272 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/stable-dist-rustc-mac/build/obj/../src/libcore/ptr.rs", directory: "/Users/stanislaw/Projects/mull/lab/rust")
!273 = !DINamespace(name: "{{impl}}", scope: !274, file: !7)
!274 = !DINamespace(name: "ptr", scope: !11, file: !7)
!275 = !DISubroutineType(types: !276)
!276 = !{!277, !278}
!277 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !17, size: 64, align: 64)
!279 = !{!280}
!280 = !DITemplateTypeParameter(name: "T", type: !17)
!281 = !DILocalVariable(name: "self", arg: 1, scope: !271, file: !42, line: 1, type: !278)
!282 = !DILocation(line: 1, scope: !271)
!283 = !DILocalVariable(name: "self", scope: !284, file: !272, line: 404, type: !278)
!284 = distinct !DILexicalBlock(scope: !271, file: !272, line: 404, column: 48)
!285 = !DILocation(line: 404, scope: !284)
!286 = !DILocation(line: 404, scope: !271)
!287 = !DILocation(line: 405, scope: !284)
!288 = !DILocation(line: 406, scope: !284)
!289 = distinct !DISubprogram(name: "null_mut<u8>", linkageName: "_ZN4core3ptr12null_mut<u8>E", scope: !274, file: !272, line: 69, type: !290, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !279, variables: !81)
!290 = !DISubroutineType(types: !291)
!291 = !{!278}
!292 = !DILocation(line: 69, scope: !289)
!293 = distinct !DISubprogram(name: "exchange_malloc", linkageName: "_ZN5alloc4heap15exchange_mallocE", scope: !295, file: !294, line: 133, type: !296, isLocal: false, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, unit: !3, templateParams: !81, variables: !81)
!294 = !DIFile(filename: "/Users/rustbuild/src/rust-buildbot/slave/stable-dist-rustc-mac/build/obj/../src/liballoc/heap.rs", directory: "/Users/stanislaw/Projects/mull/lab/rust")
!295 = !DINamespace(name: "heap", scope: !104, file: !7)
!296 = !DISubroutineType(types: !297)
!297 = !{!278, !54, !54}
!298 = !DILocalVariable(name: "size", arg: 1, scope: !293, file: !42, line: 1, type: !54)
!299 = !DILocation(line: 1, scope: !293)
!300 = !DILocalVariable(name: "align", arg: 2, scope: !293, file: !42, line: 1, type: !54)
!301 = !DILocalVariable(name: "size", scope: !302, file: !294, line: 133, type: !54)
!302 = distinct !DILexicalBlock(scope: !293, file: !294, line: 133, column: 64)
!303 = !DILocation(line: 133, scope: !302)
!304 = !DILocalVariable(name: "align", scope: !302, file: !294, line: 133, type: !54)
!305 = !DILocalVariable(name: "ptr", scope: !306, file: !294, line: 137, type: !278)
